In [16]:
import pandas as pd #import pandas sebagai libray yang akan di pakai di posttest 2 in

# Baca dataset dari file CSV
df = pd.read_csv('ramen-ratings.csv')
df.head()

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN

In [20]:
#Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

df.describe().loc[['mean', 'std', 'max', '25%', '50%', '75%']]

         Review #
mean  1290.500000
std    744.926171
max   2580.000000
25%    645.750000
50%   1290.500000
75%   1935.250000

In [25]:
#Tampilkan 10 record pertama dari dataset dengan attribute bertipe angka.

kolom_angka = df.select_dtypes(include=['int', 'float'])
kolom_angka= df[['Stars']]
df.head(10)

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN
5,2575,Samyang Foods,Kimchi song Song Ramen,Pack,South Korea,4.75,NaN
6,2574,Acecook,Spice Deli Tantan Men With Cilantro,Cup,Japan,4,NaN
7,2573,Ikeda Shoku,Nabeyaki Kitsune Udon,Tray,Japan,3.75,NaN
8,2572,Ripe'n'Dry,Hokkaido Soy Sauce Ramen,Pack,Japan,0.25,NaN
9,2571,KOKA,The Original Spicy Stir-Fried Noodles,Pack,Singapore,2.5,NaN

In [26]:
#Tampilkan informasi jumlah record, jumlah attribute, nama attribute, jumlah attribute dengan tipe angka. Masukkan informasi tersebut dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.

num_attributes = len(df.columns)
attribute_names = list(df.columns)
numeric_attributes = len(df.select_dtypes(include=['number']).columns)
info_dict = {
    'Jumlah Record'                   : num_records,
    'Jumlah Atribut'                  : num_attributes,
    'Nama Atribut'                    : attribute_names,
    'Jumlah Atribut dengan Tipe Angka': numeric_attributes
}
for key, value in info_dict.items():
    print(f'{key}: {value}')

Jumlah Record: 2580
Jumlah Atribut: 7
Nama Atribut: ['Review #', 'Brand', 'Variety', 'Style', 'Country', 'Stars', 'Top Ten']
Jumlah Atribut dengan Tipe Angka: 1

In [27]:
#Tampilkan nilai dataset pada baris dimulai dengan 3 digit NIM akhir hingga data terakhir dan kolom ke 4 hingga kolom terakhir menggunakan ke 2 metode slice.

df.iloc[92:, 3:]

     Style   Country Stars Top Ten
92    Pack   Germany  3.75     NaN
93     Cup   Germany   4.5     NaN
94    Pack   Germany   3.5     NaN
95     Cup   Germany     3     NaN
96    Pack   Germany     4     NaN
...    ...       ...   ...     ...
2575  Bowl   Vietnam   3.5     NaN
2576  Pack  Thailand     1     NaN
2577  Pack  Thailand     2     NaN
2578  Pack  Thailand     2     NaN
2579  Pack       USA   0.5     NaN

[2488 rows x 4 columns]

In [28]:
#Tampilkan jumlah label dari semua attribute yang bernilai object (contoh : Jenis Kelamin, Agama).

objectList = df.select_dtypes(include=['object']).columns.tolist()
objectList.pop(0)

for i in objectList:
    print(df[i].value_counts())

Beef                                              7
Chicken                                           7
Yakisoba                                          6
Artificial Chicken                                6
Vegetable                                         6
                                                 ..
Oh! Ricey Pho Ga                                  1
Veggie Noodle Black Sesame Noodle                 1
Nuudeli Liha Nudlar Kott                          1
Artificial Beef Instant Noodles With Soup Base    1
Tom Yum Chili Flavor                              1
Name: Variety, Length: 2413, dtype: int64
Pack    1531
Bowl     481
Cup      450
Tray     108
Box        6
Can        1
Bar        1
Name: Style, dtype: int64
Japan            352
USA              323
South Korea      309
Taiwan           224
Thailand         191
China            169
Malaysia         156
Hong Kong        137
Indonesia        126
Singapore        109
Vietnam          108
UK                69
Philippines       47
Canada            41
India             31
Germany           27
Mexico            25
Australia         22
Netherlands       15
Myanmar           14
Nepal             14
Pakistan           9
Hungary            9
Bangladesh         7
Colombia           6
Brazil             5
Cambodia           5
Fiji               4
Holland            4
Poland             4
Finland            3
Sarawak            3
Sweden             3
Dubai              3
Ghana              2
Estonia            2
Nigeria            1
United States      1
Name: Country, dtype: int64
4          384
5          369
3.75       350
3.5        326
3          173
3.25       170
4.25       143
4.5        132
2.75        85
2           68
2.5         67
4.75        64
1.5         37
1.75        27
1           26
0           26
2.25        21
0.5         14
0.25        11
1.25        10
5.0         10
3.50         9
5.00         7
4.00         6
4.3          4
3.8          3
4.0          3
4.50         3
Unrated      3
1.1          2
2.8          2
2.9          2
4.125        2
2.3          2
3.1          2
3.0          2
2.1          1
0.9          1
0.75         1
3.125        1
2.125        1
3.00         1
0.1          1
3.3          1
3.7          1
3.4          1
3.6          1
2.85         1
3.2          1
3.65         1
1.8          1
Name: Stars, dtype: int64
\n          4
2016 #10    1
2012 #10    1
2014 #1     1
2013 #1     1
2013 #2     1
2013 #4     1
2013 #9     1
2013 #3     1
2012 #7     1
2016 #1     1
2012 #5     1
2012 #3     1
2012 #6     1
2012 #9     1
2012 #1     1
2012 #2     1
2013 #6     1
2014 #6     1
2014 #5     1
2014 #8     1
2014 #10    1
2016 #8     1
2016 #5     1
2016 #9     1
2016 #7     1
2015 #10    1
2015 #7     1
2015 #4     1
2015 #9     1
2015 #6     1
2015 #1     1
2013 #10    1
2015 #8     1
2014 #7     1
2014 #4     1
2014 #9     1
2012 #4     1
Name: Top Ten, dtype: int64

In [29]:
# Pilih atribut yang bernilai objek
atribut_objek = df.select_dtypes(include=['object'])

# Hitung jumlah label yang unik pada setiap atribut yang bernilai objek
jumlah_label = atribut_objek.nunique()

# Tampilkan hasil
print("Jumlah label dari semua atribut yang bernilai objek:")
print(jumlah_label)

Jumlah label dari semua atribut yang bernilai objek:
Brand       355
Variety    2413
Style         7
Country      38
Stars        51
Top Ten      38
dtype: int64